Repository: JosefFryk/ALTranslationProject
Catalog: Translations/ALTranslationProject.*.xlf
Languages: cs_cz

# Table 2411954415 - Field 1605594221 - Property 2879900210
source: Area of text
cs_cz: Oblast textu

# Table 2411954415 - Field 3074281231 - Property 2879900210
source: ARIA Label
cs_cz: Popisek ARIA

# Table 2411954415 - Field 3921959937 - Property 2879900210
source: ARIA Role
cs_cz: Role ARIA

# Table 2411954415 - Field 4130060952 - Property 2879900210
source: Corrected Translation
cs_cz: Opravený překlad

# Table 2411954415 - Field 687818000 - Property 2879900210
source: Cosmos Document ID
cs_cz: ID dokumentu Cosmos

# Table 2411954415 - Field 2049026805 - Property 2879900210
source: CSS Classes
cs_cz: Třídy CSS

# Table 2411954415 - Field 3245645833 - Property 2879900210
source: Data Attributes
cs_cz: Datové atributy

# Table 2411954415 - Field 897736109 - Property 2879900210
source: Element ID
cs_cz: ID prvku

# Table 2411954415 - Field 3669215363 - Property 2879900210
source: Element Name
cs_cz: Název prvku

# Table 2411954415 - Field 459507994 - Property 2879900210
source: Element Type
cs_cz: Typ prvku

# Table 2411954415 - Field 883711285 - Property 2879900210
source: Entry No.
cs_cz: Č. položky

# Table 2411954415 - Field 406262101 - Property 2879900210
source: Frame Index
cs_cz: Index rámce

# Table 2411954415 - Field 1019931697 - Property 2879900210
source: HTML Tag
cs_cz: HTML značka

# Table 2411954415 - Field 2763181653 - Property 2879900210
source: Inner Text
cs_cz: Vnitřní text

# Table 2411954415 - Field 4292282361 - Property 2879900210
source: Is ToolTip
cs_cz: Je nápověda

# Table 2411954415 - Field 894914730 - Property 2879900210
source: Page ID
cs_cz: ID stránky

# Table 2411954415 - Field 1223712979 - Property 2879900210
source: Parent Chain
cs_cz: Řetězec nadřazených prvků

# Table 2411954415 - Field 1513541189 - Property 2879900210
source: Placeholder
cs_cz: Zástupný text

# Table 2411954415 - Field 841428033 - Property 2879900210
source: Property Type
cs_cz: Typ vlastnosti

# Table 2411954415 - Field 2350441300 - Property 2879900210
source: Selector Path
cs_cz: Cesta selektoru

# Table 2411954415 - Field 4078167330 - Property 2879900210
source: Synced
cs_cz: Synchronizováno

# Table 2411954415 - Field 3524147737 - Property 2879900210
source: Synced DateTime
cs_cz: Datum a čas synchronizace

# Table 2411954415 - Field 3499607352 - Property 2879900210
source: Title Attribute
cs_cz: Atribut title

# Table 2411954415 - Field 3400962969 - Property 2879900210
source: Translated Text
cs_cz: Přeložený text

# Table 2411954415 - Field 1593390805 - Property 2879900210
source: UI Area
cs_cz: Oblast UI

# Table 2279258808 - Property 2879900210
source: Translation Setup
cs_cz: Nastavení překladu

# Table 2279258808 - Field 2527409296 - Property 2879900210
source: Capture Shortcut
cs_cz: Zkratka pro zachycení

# Table 2279258808 - Field 2505711900 - Property 2879900210
source: Container Name
cs_cz: Název kontejneru

# Table 2279258808 - Field 3359693069 - Property 2879900210
source: Cosmos DB Endpoint
cs_cz: Koncový bod Cosmos DB

# Table 2279258808 - Field 4136603814 - Property 2879900210
source: Cosmos Time Offset (Minutes)
cs_cz: Časový posun Cosmos (minuty)

# Table 2279258808 - Field 3149170790 - Property 2879900210
source: Database Name
cs_cz: Název databáze

# Table 2279258808 - Field 2723849176 - Property 2879900210
source: Last Sync DateTime
cs_cz: Datum a čas poslední synchronizace

# Table 2279258808 - Field 900697603 - Property 2879900210
source: Last Sync Status
cs_cz: Stav poslední synchronizace

# Table 2279258808 - Field 1663593181 - Property 2879900210
source: Primary Key
cs_cz: Primární klíč

# Table 2279258808 - Field 3336421100 - Property 2879900210
source: Records Synced
cs_cz: Synchronizované záznamy

# Table 2279258808 - Field 2767662982 - Property 2879900210
source: Sync Enabled
cs_cz: Synchronizace povolena

# Page 876277669 - Property 2879900210
source: Set Cosmos DB Key
cs_cz: Nastavit klíč Cosmos DB

# Page 876277669 - Control 864295971 - Property 2879900210
source: Enter Cosmos DB Primary Key
cs_cz: Zadejte primární klíč Cosmos DB

# Page 876277669 - Control 237080667 - Property 1295455071
source: Enter your Azure Cosmos DB primary or secondary key
cs_cz: Zadejte primární nebo sekundární klíč Azure Cosmos DB

# Page 876277669 - Control 237080667 - Property 2879900210
source: Cosmos DB Key
cs_cz: Klíč Cosmos DB

# Page 491025131 - Property 2879900210
source: Translations
cs_cz: Překlady

# Page 491025131 - Control 1605594221 - Property 1295455071
source: The page or area where the text was captured
cs_cz: Stránka nebo oblast, kde byl text zachycen

# Page 491025131 - Control 4130060952 - Property 1295455071
source: Your corrected translation for this text
cs_cz: Vaše opravená varianta překladu pro tento text

# Page 491025131 - Control 459507994 - Property 1295455071
source: Type of UI element: Field, Action, Menu, Tab, Column
cs_cz: Typ prvku UI: pole, akce, nabídka, karta, sloupec

# Page 491025131 - Control 894914730 - Property 1295455071
source: The Business Central page ID
cs_cz: ID stránky Business Central

# Page 491025131 - Control 841428033 - Property 1295455071
source: Caption or ToolTip
cs_cz: Popisek nebo nápověda

# Page 491025131 - Control 4078167330 - Property 1295455071
source: Indicates if this record has been synced to Cosmos DB
cs_cz: Určuje, zda byl tento záznam synchronizován s Cosmos DB

# Page 491025131 - Control 3524147737 - Property 1295455071
source: When this record was synced to Cosmos DB
cs_cz: Kdy byl tento záznam synchronizován s Cosmos DB

# Page 491025131 - Control 3400962969 - Property 1295455071
source: The original text captured from the UI
cs_cz: Původní text zachycený z uživatelského rozhraní

# Page 491025131 - Control 1593390805 - Property 1295455071
source: Ribbon, List, Dialog, Content
cs_cz: Pás karet, seznam, dialog, obsah

# Page 491025131 - Action 4090651158 - Property 1295455071
source: Mark the selected records as unsynced (will be re-synced on next run)
cs_cz: Označit vybrané záznamy jako nesynchronizované (při příštím spuštění se znovu synchronizují)

# Page 491025131 - Action 4090651158 - Property 2879900210
source: Mark as Unsynced
cs_cz: Označit jako nesynchronizované

# Page 491025131 - Action 4007289061 - Property 1295455071
source: Open the Translation Setup page
cs_cz: Otevřít stránku Nastavení překladu

# Page 491025131 - Action 4007289061 - Property 2879900210
source: Setup
cs_cz: Nastavení

# Page 491025131 - Action 2373794858 - Property 1295455071
source: Sync the selected records to Cosmos DB
cs_cz: Synchronizovat vybrané záznamy do Cosmos DB

# Page 491025131 - Action 2373794858 - Property 2879900210
source: Sync Selected
cs_cz: Synchronizovat vybrané

# Page 2279258808 - Property 2879900210
source: Translation Setup
cs_cz: Nastavení překladu

# Page 2279258808 - Control 2644753651 - Property 2879900210
source: Capture Settings
cs_cz: Nastavení zachytávání

# Page 2279258808 - Control 2527409296 - Property 1295455071
source: Keyboard shortcut to capture text (e.g., Ctrl+Shift+F, Alt+T). Restart role center after change.
cs_cz: Klávesová zkratka pro zachycení textu (např. Ctrl+Shift+F, Alt+T). Po změně restartujte Role Center.

# Page 2279258808 - Control 2505711900 - Property 1295455071
source: The name of the container for BC corrections. Default: BCCorrections
cs_cz: Název kontejneru pro opravy BC. Výchozí: BCCorrections

# Page 2279258808 - Control 3359693069 - Property 1295455071
source: The endpoint URL of your Azure Cosmos DB account (e.g., https://your-account.documents.azure.com:443/)
cs_cz: Koncová adresa URL vašeho účtu Azure Cosmos DB (např. https://your-account.documents.azure.com:443/)

# Page 2279258808 - Control 4136603814 - Property 1295455071
source: Adjust the time used for Cosmos DB auth in minutes (negative if server time is ahead). Cosmos accepts only about +/- 15 minutes of skew.
cs_cz: Upravte čas používaný pro ověřování Cosmos DB v minutách (záporně, pokud je čas serveru napřed). Cosmos toleruje pouze asi +/- 15 minut odchylky.

# Page 2279258808 - Control 854175919 - Property 1295455071
source: Indicates whether the Cosmos DB key is configured
cs_cz: Určuje, zda je klíč Cosmos DB nakonfigurován

# Page 2279258808 - Control 854175919 - Property 2879900210
source: Cosmos Key Status
cs_cz: Stav klíče Cosmos

# Page 2279258808 - Control 3149170790 - Property 1295455071
source: The name of the database in Cosmos DB. Default: translations
cs_cz: Název databáze v Cosmos DB. Výchozí: translations

# Page 2279258808 - Control 513339096 - Property 2879900210
source: Last Sync Status
cs_cz: Stav poslední synchronizace

# Page 2279258808 - Control 2723849176 - Property 1295455071
source: The date and time of the last sync operation
cs_cz: Datum a čas poslední synchronizace

# Page 2279258808 - Control 900697603 - Property 1295455071
source: The result of the last sync operation
cs_cz: Výsledek poslední synchronizace

# Page 2279258808 - Control 3336421100 - Property 1295455071
source: The number of records synced in the last operation
cs_cz: Počet záznamů synchronizovaných při poslední operaci

# Page 2279258808 - Control 1319494566 - Property 2879900210
source: Sync Settings
cs_cz: Nastavení synchronizace

# Page 2279258808 - Control 2767662982 - Property 1295455071
source: Enable automatic synchronization of translation corrections to Cosmos DB
cs_cz: Povolit automatickou synchronizaci oprav překladů do Cosmos DB

# Page 2279258808 - Action 1297282948 - Property 1295455071
source: Remove the stored Cosmos DB key
cs_cz: Odstranit uložený klíč Cosmos DB

# Page 2279258808 - Action 1297282948 - Property 2879900210
source: Clear Cosmos Key
cs_cz: Vymazat klíč Cosmos

# Page 2279258808 - Action 701328781 - Property 1295455071
source: Set the Azure Cosmos DB primary key (stored securely)
cs_cz: Nastavit primární klíč Azure Cosmos DB (uložen bezpečně)

# Page 2279258808 - Action 701328781 - Property 2879900210
source: Set Cosmos Key
cs_cz: Nastavit klíč Cosmos

# Page 2279258808 - Action 4271163235 - Property 1295455071
source: Create or update the Job Queue entry for automatic daily sync
cs_cz: Vytvořit nebo aktualizovat položku fronty úloh pro automatickou denní synchronizaci

# Page 2279258808 - Action 4271163235 - Property 2879900210
source: Setup Job Queue
cs_cz: Nastavit frontu úloh

# Page 2279258808 - Action 3470463835 - Property 1295455071
source: Manually run the sync operation now
cs_cz: Spustit synchronizaci ručně nyní

# Page 2279258808 - Action 3470463835 - Property 2879900210
source: Sync Now
cs_cz: Synchronizovat nyní

# Page 2279258808 - Action 4263468516 - Property 1295455071
source: Test the connection to Azure Cosmos DB
cs_cz: Otestovat připojení k Azure Cosmos DB

# Page 2279258808 - Action 4263468516 - Property 2879900210
source: Test Connection
cs_cz: Otestovat připojení

# Page 2961250263 - Property 2879900210
source: Translations
cs_cz: Překlady

# Page 2961250263 - Action 989939050 - Property 1295455071
source: Open the full Translations list
cs_cz: Otevřít celý seznam překladů

# Page 2961250263 - Action 989939050 - Property 2879900210
source: Open Full List
cs_cz: Otevřít celý seznam

# Page 2961250263 - Action 1514883969 - Property 1295455071
source: Open Translation Setup
cs_cz: Otevřít nastavení překladu

# Page 2961250263 - Action 1514883969 - Property 2879900210
source: Setup
cs_cz: Nastavení

# Page 2961250263 - Action 3168527114 - Property 1295455071
source: Sync all pending records to Cosmos DB
cs_cz: Synchronizovat všechny čekající záznamy do Cosmos DB

# Page 2961250263 - Action 3168527114 - Property 2879900210
source: Sync All
cs_cz: Synchronizovat vše

# Page 2961250263 - Action 2373794858 - Property 1295455071
source: Sync selected records to Cosmos DB
cs_cz: Synchronizovat vybrané záznamy do Cosmos DB

# Page 2961250263 - Action 2373794858 - Property 2879900210
source: Sync Selected
cs_cz: Synchronizovat vybrané

# Page 1768841259 - Property 2879900210
source: Translator
cs_cz: Překladatel

# Page 1768841259 - Action 491025131 - Property 1295455071
source: View and manage captured translations
cs_cz: Zobrazit a spravovat zachycené překlady

# Page 1768841259 - Action 491025131 - Property 2879900210
source: Translations
cs_cz: Překlady

# Page 1768841259 - Action 1514883969 - Property 1295455071
source: Configure Cosmos DB sync settings
cs_cz: Konfigurovat nastavení synchronizace Cosmos DB

# Page 1768841259 - Action 1514883969 - Property 2879900210
source: Translation Setup
cs_cz: Nastavení překladu

# Profile 3749812207 - Property 2879900210
source: Translator
cs_cz: Překladatel
